#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОперациюНаСервере()
	Попытка
		// код, приводящий к вызову исключения
	Исключение
		// Запись события в журнал регистрации для системного администратора.
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию()
	Попытка
		ВыполнитьОперациюНаСервере();
	Исключение
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение(,НСтр("ru = 'Операция не может быть выполнена по причине:'") + Символы.ПС + ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
